# DimensionSegmentArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegmentArray Class
Members See Also
---
An array that can contain any number of DimensionSegment objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DimensionSegmentArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class DimensionSegmentArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class DimensionSegmentArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DimensionSegmentArray
# See Also
DimensionSegmentArray Members
Autodesk.Revit.DB Namespace